abstract class AppString {

  static const host_get_token = 'https://app.ferfit.club/api/auth/refresh-tokens';
  static const host_get_news = 'https://app.ferfit.club/api/feed?limit=10&offset=0&maxDate=2021-05-06T18:26:42.820994';
  static const bearer = 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6NTksImlhdCI6MTYyMDQ5MTYxNCwiZXhwIjoxMDAxNjIwNDkxNjE0fQ.zGqmT0dH2bUMkG5DltUciML5CCXDbXsdO3p5a6AH5Z8';
  static const cookiePolicy = 'Политика использования куки файлов (далее "Политика") представляет собой документ, в котором собственник веб-сайта объясняет его пользователям какие куки файлы применяются данным веб-сайтом. Настоящая Политика является договором о присоединении, согласно которому пользователь соглашается на условия работы куки файлов определенного веб-сайта и их последующею установку на устройство пользователя. Куки файлы (файлы куки, cookies файлы и т.д) сегодня доступны практически на каждом сайте в сети Интернет. Они представляют собой небольшие фрагменты данных, которые хранятся на компьютере (планшете, мобильном телефоне или другом устройстве) пользователя и позволяют записывать определенную информацию при любом посещении сайта. К такой информации, которую запоминает сайт, принадлежат языковые настройки пользователя, выбранные для навигации, геолокация пользователя, последние добавленные товары/услуги в корзину и т.п. Куки файлы направлены на упрощение взаимодействия пользователя с веб-сайтом, улучшение возможностей пользования сайтом, а также для идентификации пользователя. Согласие пользователя на установку куку файлов может быть выражено разными способами, к примеру, проставление галочки на против "Я согласен" в всплывающем окне при входе на веб-сайт. Данная Политика предназначена для Российской Федерации, однако ее положения также адаптированы к требованиям Общего регламента защиты персональных данных (GDRP), что позволяет функционировать веб-сайту на территории стран-членов Европейского Союза. Обращаем внимание, что настоящая Политика является неотъемлемой частью общей политики конфиденциальности и обработки персональных данных пользователей веб-сайта или для мобильного приложения, которая в свою очередь определяет принципы, цели и способы обработки персональных данных пользователей веб-сайта. Как использовать документ Основной целью документа является донести пользователям веб-сайта простым языком о том, какие куки файлы используются данным веб-сайтом, какую информацию о пользователях они собирают и для каких целей совершается ее сбор. Нужно отметить, что куки файлы НЕ СОБИРАЮТ персонализированную или личную информацию о пользователях. Структура предложенного шаблона дает возможность собственникам веб-сайтов зафиксировать всю необходимую информацию, в частности: (1) исчерпывающий перечень куки файлов, используемых собственником веб-сайта, а также третьими лицами. (2) цели использования куки файлов, а также сроки их хранения на устройстве пользователя. (3) порядок получения согласия от пользователей на работу куки файлов. (4) порядок отзыва пользователями своего согласия на работу куки файлов. Данный документ должен быть в обязательном порядке опубликован непосредственно на самом веб-сайте вместе с Пользовательским соглашением для веб-сайта и Общей политикой конфиденциальности веб-сайта. Применимое законодательство Политика использования куки файлов разработана в соответствие с положениями Федерального закона "О персональных данных", Федерального закона "О внесении изменений в отдельные законодательные акты Российской Федерации в части уточнения порядка обработки персональных данных в информационно-телекоммуникационных сетях", правилами Общего регламента по защите персональных данных от 27 апреля 2016 года (GDRP), а также с устоявшейся практикой подготовки документов такого вида.';
  static const titleCookie = 'Политика в отношении файлов cookie';
  static const titleData = 'Политика использования данных';
  static const cookieData = '1. ОБЩИЕ ПОЛОЖЕНИЯ\n'
  '1.1. Политика является неотъемлемой частью пользовательского соглашения интернет-сайта qwertypay.com (далее – Соглашение), определяет порядок обработки и защиты персональной информации, загружаемой Пользователями на Сайте. Термины, употребляемые в Соглашении, применимы к Политике.\n'
  '1.2. Регистрируясь на Сайте, Пользователь дает свое согласие на обработку его персональных данных (персональной информации).\n'
  '1.3. Под персональной информацией понимается загруженная Пользователем при прохождении процедуры регистрации на Сайте, личная информация, которая включает в себя:\n'
  '- фамилия, имя, отчество Пользователя; (не обязательно)\n'
  '- адрес электронной почты Пользователя;\n'
  '- номер телефона Пользователя;\n'
  '- «Аватар» – фото/логотип Пользователя.\n'
  '- реквизиты электронных кошельков Пользователя, указанные им для осуществления оплаты Товара и/или выплат вознаграждений.\n'
  '- иная информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных), переданная Пользователем при использовании Сайта.\n'
  '1.4. Любая персональная информация, загружаемая Пользователем на Сайте, воспринимается Администратором Сайта «как есть» и не подлежит предварительной проверке на предмет достоверности. Бремя ответственности за достоверность предоставленной на Сайте информации несет лично Пользователь.\n'
  '1.5. При раскрытии или предоставлении информации Администратором соблюдаются требования обеспечения конфиденциальности и меры по обеспечению безопасности персональных данных при их обработке.\n'
  '1.6. Сайт работает по безопасному соединению SSL (протокол https), представляющий собой криптографический протокол, который подразумевает более безопасную связь Пользователей с Сайтом. Протокол использует асимметричную криптографию для аутентификации ключей обмена, симметричное шифрование для сохранения конфиденциальности, коды аутентификации сообщений для целостности сообщений.\n'
  '2. ЦЕЛЬ ОБРАБОТКИ ДАННЫХ\n'
  '2.1. Целями обработки данных Пользователя являются:\n'
  '- обеспечение максимального качества оказания услуг Исполнителем по Соглашению;\n'
  '- предоставление Пользователю возможности полноценно использовать Сервисы Сайта;\n'
  '- идентификация Пользователя при разрешении спорных ситуаций.\n'
  '2.2. Обработка персональной информации основана на принципах законности и справедливости; обработки только персональных данных, которые отвечают целям их обработки; соответствия содержания и объема обрабатываемых персональных данных заявленным целям обработки.\n'
  '2.3. Обработка персональной информации осуществляется с целью обеспечения полноценного функционирования Сайта, соответствия Сайта, заявленным в преамбуле Соглашения, целям.\n'
  '2.4. Обрабатываемые персональные данные не должны быть избыточными по отношению к заявленным целям их обработки.\n'
  '3. ПЕРЕДАЧА И УДАЛЕНИЕ ДАННЫХ\n'
  '3.1. Пользователь соглашается с тем, что заполняя регистрационную форму на Сайте, добавляя информацию в своей учетной записи (профиле), а также в ином месте в процессе использования Сайта, такая информация может попасть в публичный доступ, и Пользователь не возражает против такой публикации. Это правило не относится к паспортным данным Пользователя и/или иным персональным данным, в том числе к информации о банковских счетах, электронных кошельках Пользователя.\n'
  '3.2. Администратор не производит передачу персональных данных Пользователей третьим лицам, за исключением случаев, прямо предусмотренных законодательством и международными соглашениями.\n'
  '3.3. Предоставление персональных данных Пользователей по запросу государственных органов (органов местного самоуправления) осуществляется в порядке, предусмотренном законодательством.\n'
  '3.4. Информация, размещенная на Сайте Пользователем, хранится в течение всего срока использования Сайта, а при удалении учетной записи Пользователя, в течение срока, определяемого Администратором Сайта, но не более 12 (Двенадцати) месяцев с момента удаления соответствующей учетной записи. По заявлению Пользователя, направленного Администратору, персональная информация о Пользователе подлежит удалению в течение 30 (Тридцати) дней с момента получения такого заявления Администратором.\n'
  '4. ОБЕСПЕЧЕНИЕ БЕЗОПАСНОСТИ ОБРАБОТКИ ДАННЫХ\n'
  '4.1. Администратор принимает технические и организационно-правовые меры в целях обеспечения защиты персональных данных Пользователя от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий.\n'
  '4.2. Для просмотра Сайта не предусматриваться установка на компьютере Пользователей специально созданных с этой целью технологических и программных средств.\n'
  '4.3. В целях обеспечения безопасности персональных данных Администратором проводятся следующие мероприятия:\n'
  '- определяются угрозы безопасности персональных данных при их обработке на Сайте;\n'
  '- применяются организационные и технические меры по обеспечению безопасности персональных данных при их обработке на Сайте;\n'
  '- применяются средства защиты информации, прошедшие в установленном порядке процедуру оценки соответствия;\n'
  '- проводится оценка эффективности принимаемых мер по обеспечению безопасности персональных данных;\n'
  '- принимаются процедуры, направленные на выявление фактов несанкционированного доступа к персональным данным и принятием соответствующих мер;\n'
  '- производится восстановление персональных данных, модифицированных или уничтоженных вследствие несанкционированного доступа к ним;\n'
  '- устанавливаются правила доступа к персональным данным, обрабатываемым на Сайте, а также обеспечивается регистрация и учет всех действий, совершаемых с персональными данными на Сайте;\n'
  '- осуществляется постоянный контроль над принимаемыми мерами по обеспечению безопасности персональных данных и уровнем защищенности информационных систем персональных данных.\n'
  '5. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ\n'
  '5.1. Настоящий документ является общедоступным, его действующая редакция всегда расположена на Сайте по ссылке – http://qwertypay.com/privacy_policy.html .\n'
  '5.2. Текст настоящего документа подлежит изменению, дополнению в случае появления новых законодательных актов и специальных нормативных документов по обработке и защите персональных данных.\n'
  '5.3. Контроль исполнения требований настоящего документа осуществляется Администратором – ответственным лицом за обеспечение безопасности персональных данных.';

}
abstract class AppErrors{
  static const network = 'Сервер не доступен. Проверьте подключение к Интернету';
  static const auth = 'Авторизация не удалась, попробуйте еще раз';
  static const other = 'Произошла ошибка, попробуйте ещё раз';
  static const getData = 'Произошла ошибка получения данных';
  static const loginOrPasswordIncorrect = 'Логин или пароль неверны';
}
abstract class AppWidgetName{
  static const alt_news = 'Новости';
  static const alt_video = 'Видео';
  static const alt_lk = 'Пользователь';
  static const alt_magazine = 'Магазин';
  static const alt_about = 'О нас';
}